RT-Thread/rt-thread/bsp/nuvoton_m487/libraries/StdDriver/src/sdh.c
/* there are 8 bits for divider0, maximum is 256 */
#define SDH_CLK_DIV0_MAX     256ul

void SDH_Set_clock(SDH_T *sdh, uint32_t sd_clock_khz)
{
    uint32_t rate, div1;
    static uint32_t u32SD_ClkSrc = 0ul, u32SD_PwrCtl = 0ul;

    SYS_UnlockReg();

    /* initial state, clock source use HIRC */
    if (sd_clock_khz <= 400ul)
    {
        u32SD_PwrCtl = CLK->PWRCTL;
        if ((u32SD_PwrCtl & CLK_PWRCTL_HIRCEN_Msk) != 0x4ul)
        {
            CLK->PWRCTL |= CLK_PWRCTL_HIRCEN_Msk;
        }

        if (sdh == SDH0)
        {
            u32SD_ClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDH0SEL_Msk);
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH0SEL_Msk) | CLK_CLKSEL0_SDH0SEL_HIRC;
        }
        else
        {
            u32SD_ClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDH1SEL_Msk);
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH1SEL_Msk) | CLK_CLKSEL0_SDH1SEL_HIRC;
        }
        _SDH_ReferenceClock = (__HIRC / 1000ul);
    }
    /* transfer state, clock source use sys_init() */
    else
    {
        CLK->PWRCTL = u32SD_PwrCtl;
        if (sdh == SDH0)
        {
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH0SEL_Msk) | u32SD_ClkSrc;
            if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HXT)
            {
                _SDH_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HIRC)
            {
                _SDH_ReferenceClock = (__HIRC / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_PLL)
            {
                _SDH_ReferenceClock = (CLK_GetPLLClockFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH0SEL_HCLK)
            {
                _SDH_ReferenceClock = (CLK_GetHCLKFreq() / 1000ul);
            }
        }
        else
        {
            CLK->CLKSEL0 = (CLK->CLKSEL0 & ~CLK_CLKSEL0_SDH1SEL_Msk) | u32SD_ClkSrc;
            if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HXT)
            {
                _SDH_ReferenceClock = (CLK_GetHXTFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HIRC)
            {
                _SDH_ReferenceClock = (__HIRC / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_PLL)
            {
                _SDH_ReferenceClock = (CLK_GetPLLClockFreq() / 1000ul);
            }
            else if(u32SD_ClkSrc == CLK_CLKSEL0_SDH1SEL_HCLK)
            {
                _SDH_ReferenceClock = (CLK_GetHCLKFreq() / 1000ul);
            }
        }

        if(sd_clock_khz >= 50000ul)
        {
            sd_clock_khz = 50000ul;
        }
    }
    rate = _SDH_ReferenceClock / sd_clock_khz;

    /* choose slower clock if system clock cannot divisible by wanted clock */
    if ((_SDH_ReferenceClock % sd_clock_khz) != 0ul)
    {
        rate++;
    }

    if(rate >= SDH_CLK_DIV0_MAX)
    {
        rate = SDH_CLK_DIV0_MAX;
    }

    /*--- calculate the second divider CLKDIV0[SDHOST_N]*/
    div1 = (rate - 1ul) & 0xFFul;

    /*--- setup register */
    if (sdh == SDH0)
    {
        CLK->CLKDIV0 &= ~CLK_CLKDIV0_SDH0DIV_Msk;
        CLK->CLKDIV0 |= (div1 << CLK_CLKDIV0_SDH0DIV_Pos);
    }
    else
    {
        CLK->CLKDIV3 &= ~CLK_CLKDIV3_SDH1DIV_Msk;
        CLK->CLKDIV3 |= (div1 << CLK_CLKDIV3_SDH1DIV_Pos);
    }
    return;
}

uint32_t SDH_CardDetection(SDH_T *sdh)
{
    uint32_t i, val = TRUE;
    SDH_INFO_T *pSD;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }


    if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) == SDH_INTEN_CDSRC_Msk)   /* Card detect pin from GPIO */
    {
        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk)   /* Card remove */
        {
            pSD->IsCardInsert = (uint8_t)FALSE;
            val = FALSE;
        }
        else
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
    }
    else if ((sdh->INTEN & SDH_INTEN_CDSRC_Msk) != SDH_INTEN_CDSRC_Msk)
    {
        sdh->CTL |= SDH_CTL_CLKKEEP_Msk;
        for(i= 0ul; i < 5000ul; i++)
        {
        }

        if ((sdh->INTSTS & SDH_INTSTS_CDSTS_Msk) == SDH_INTSTS_CDSTS_Msk)   /* Card insert */
        {
            pSD->IsCardInsert = (uint8_t)TRUE;
        }
        else
        {
            pSD->IsCardInsert = (uint8_t)FALSE;
            val = FALSE;
        }

        sdh->CTL &= ~SDH_CTL_CLKKEEP_Msk;
    }

    return val;
}

uint32_t SDH_Init(SDH_T *sdh)
{
    uint32_t volatile i, status;
    uint32_t resp;
    uint32_t CIDBuffer[4];
    uint32_t volatile u32CmdTimeOut;
    SDH_INFO_T *pSD;

    if (sdh == SDH0)
    {
        pSD = &SD0;
    }
    else
    {
        pSD = &SD1;
    }

    /* set the clock to 300KHz */
    SDH_Set_clock(sdh, 300ul);

    /* power ON 74 clock */
    sdh->CTL |= SDH_CTL_CLK74OEN_Msk;

    while ((sdh->CTL & SDH_CTL_CLK74OEN_Msk) == SDH_CTL_CLK74OEN_Msk)
    {
        if (pSD->IsCardInsert == FALSE)
        {
            return SDH_NO_SD_CARD;
        }
    }

    SDH_SDCommand(sdh, 0ul, 0ul);        /* reset all cards */
    for (i=0x1000ul; i>0ul; i--)
    {
    }

    /* initial SDHC */
    _SDH_uR7_CMD = 1ul;
    u32CmdTimeOut = 0xFFFFFul;

    i = SDH_SDCmdAndRsp(sdh, 8ul, 0x00000155ul, u32CmdTimeOut);
    if (i == Successful)
    {
        /* SD 2.0 */
        SDH_SDCmdAndRsp(sdh, 55ul, 0x00ul, u32CmdTimeOut);
        g_u8R3Flag = 1ul;
        SDH_SDCmdAndRsp(sdh, 41ul, 0x40ff8000ul, u32CmdTimeOut); /* 2.7v-3.6v */
        resp = sdh->RESP0;

        while ((resp & 0x00800000ul) != 0x00800000ul)        /* check if card is ready */
        {
            SDH_SDCmdAndRsp(sdh, 55ul, 0x00ul, u32CmdTimeOut);
            g_u8R3Flag = 1ul;
            SDH_SDCmdAndRsp(sdh, 41ul, 0x40ff8000ul, u32CmdTimeOut); /* 3.0v-3.4v */
            resp = sdh->RESP0;
        }
        if ((resp & 0x00400000ul) == 0x00400000ul)
        {
            pSD->CardType = SDH_TYPE_SD_HIGH;
        }
        else
        {
            pSD->CardType = SDH_TYPE_SD_LOW;
        }
    }
    else
    {
        /* SD 1.1 */
        SDH_SDCommand(sdh, 0ul, 0ul);        /* reset all cards */
        for (i=0x100ul; i>0ul; i--)
        {
        }

        i = SDH_SDCmdAndRsp(sdh, 55ul, 0x00ul, u32CmdTimeOut);
        if (i == 2ul)     /* MMC memory */
        {

